[
  {
    "employer": "Verve",
    "dateStart": "October 2016",
    "dateEnd": "January 2019",
    "positions": [
      {
        "title": "Software Engineer",
        "dateStart": "March 2018",
        "dateEnd": "January 2019"
      },
      {
        "title": "Front End Engineer",
        "dateStart": "October 2016",
        "dateEnd": "February 2018"
      }
    ],
    "description": [
      "Verve is a mobile advertising company that uses location data to improve targeting tactics and power custom creatives.",
      "I worked as part of the Verve Foundry team, the in-house creative studio that designs and builds innovative ads for clients across a variety of verticals. During my first 6 months at Verve, I focused on developing ad units. Shortly thereafter, my role evolved and, in addition to my existing responsibilities, I spent my time working on various tools and processes, such as creating new custom components to our development library, developing new templates for faster development, and building internal web applications that showcased Verve Foundry's work. I also evaluated third-party integrations and created prototypes of new, innovative ad formats and functionalities."
    ],
    "technologies": [
      "JavaScript (ES6)",
      "Vue",
      "Riot",
      "Node",
      "Git"
    ],
    "hasWorkSamples": true
  },
  {
    "employer": "Observer Media",
    "dateStart": "November 2015",
    "dateEnd": "October 2016",
    "positions": [
      {
        "title": "Software Engineer",
        "dateStart": "November 2015",
        "dateEnd": "October 2016"
      }
    ],
    "description": [
      "Observer Media is a publisher known for the iconic weekly newspaper <em>The New York Observer</em>. Observer Media also publishes <em>Commercial Observer</em>, a commercial real estate publication, as well as the websites <OutboundLink eventlabel=\"Observer\" to=\"https://observer.com/\">observer.com</OutboundLink>, <OutboundLink eventlabel=\"Commercial Observer\" to=\"https://commercialobserver.com/\">commercialobserver.com</OutboundLink>, and <OutboundLink eventlabel=\"Realgraph\" to=\"https://realgraph.co/\">realgraph.co</OutboundLink> (formerly a subsection of Commercial Observer).",
      "My main project for Observer, a WordPress VIP site, was working with the Brand Creative Director to execute a full site redesign over the course of approximately six months. I also worked on various internal plugins that improved workflows for the editorial staff. Both theme modifications and plugin logic were reviewed and deployed by Automattic, the company that offers the WordPress VIP service.",
      "The Commercial Observer website was a bit different; it was a hybrid that used WordPress as the content management system for the editorial team, and Django for the actual user-facing application. Content was pulled in using the WordPress API, duplicated into the Django application, and then presented to the user. All of the Realgraph data and functionality lived strictly within the Django application, and most of the front end was written in Angular 1.0. Most of my work on Commercial Observer consisted of building out new features for the Realgraph platform.",
      "I also worked on various smaller projects for both properties, like developing email newsletter templates with Sailthru and building out custom ad units."
    ],
    "technologies": [
      "JavaScript",
      "PHP",
      "WordPress (VIP)",
      "Python",
      "Django",
      "Angular (1.x)",
      "Google Analytics",
      "DoubleClick (DFP)",
      "Email development",
      "Git"
    ],
    "hasWorkSamples": true
  },
  {
    "employer": "Time Inc.",
    "dateStart": "November 2013",
    "dateEnd": "November 2015",
    "positions": [
      {
        "title": "Associate Manager, Internet Development",
        "dateStart": "September 2014",
        "dateEnd": "November 2015"
      },
      {
        "title": "Assistant Web Developer",
        "dateStart": "November 2013",
        "dateEnd": "August 2014"
      }
    ],
    "description": [
      "I was part of the Online Operations team within the Consumer Marketing + Revenue department at Time Inc. Because CM+R was a centralized department, I got the opportunity to work on all of the brands within Time Inc.'s portfolio. Most of my work revolved around developing house ads and microsites that would drive users to subscribe to our magazines and services. I was also tasked with conducting weekly code review meetings with our offshore team.",
      "In 2015, I  began working on the initiative to gate premium content behind paywalls across all of the company's brands. During this ongoing project, I worked with multiple internal teams (UX, editorial, analytics team, and more) as well as our third-party vendor Tinypass. I was responsible for developing the units that were displayed in front of gated content and responded to user data provided by Tinypass."
    ],
    "technologies": [
      "JavaScript",
      "Apache Velocity",
      "Angular (1.x)",
      "DoubleClick (DFP)"
    ],
    "hasWorkSamples": true
  },
  {
    "employer": "ConnectYard",
    "dateStart": "April 2012",
    "dateEnd": "October 2013",
    "positions": [
      {
        "title": "Platform Developer",
        "dateStart": "April 2012",
        "dateEnd": "October 2013"
      }
    ],
    "description": [
      "ConnectYard is a platform for higher education that makes it more convenient for students to interact with their institution's learning management system (LMS). The platform ingests data from an LMS (course announcements, discussions, assignments) and pushes it to a user via email, social media, or text message. The user can then respond through any of those communication channels, and that data is pushed back into the LMS.",
      "I worked on the entirety of the platform, which was built on a LAMP stack; most of it was written in PHP and was connected to a Drupal instance for endpoint management. I spent my time improving the UI as well as adding new features, including a new guided signup flow for users. I was also able to improve the message queue logic, which improved the speed of outgoing messages by 10x."
    ],
    "technologies": [
      "JavaScript",
      "jQuery",
      "PHP",
      "Drupal",
      "MySQL",
      "RESTful API development"
    ],
    "hasWorkSamples": false
  },
  {
    "employer": "Wakefern Food Corporation",
    "dateStart": "June 2010",
    "dateEnd": "August 2010",
    "positions": [
      {
        "title": "Field Services / Point of Sale Programming Intern",
        "dateStart": "June 2010",
        "dateEnd": "August 2010"
      }
    ],
    "description": [
      "Wakefern is a supermarket cooperative most recognizable for its ShopRite retail stores. I was an intern during the summer of 2010 for two different teams within the Computer Information Services Division (CISD). I began working with Field Services for the first month and was responsible for setting up and troubleshooting store equipment. I worked with the Point of Sale team for the remainder of my internship.",
      "My main project was a prototype of web application for store owners that enabled them to customize the interface of their point of sale registers. This eliminated the very manual process of an owner emailing a corporate associate their requests, the associate making the changes to an XML document by hand, and then remotely uploading it to the owner's registers."
    ],
    "technologies": [
      "JavaScript",
      "ASP",
      "Java",
      "Microsoft Access"
    ],
    "hasWorkSamples": false
  }
]
